# ----------------------------------------------------------
# 표준 입력 내장함수 -> input()
# 문법 : input("요청 메시지")
# 결과 : (키보드에서)입력 받은 데이터, [str]
# ----------------------------------------------------------
"""name = input('이름을 입력: ')
print(f'이름은 {name}')

age = input('나이를 입력: ')
print(age, type(age))            # input은 무조건 str로 저장됨"""

num1 = input('정수1: ')
num2 = input('정수2: ')
print(num1,type(num1), num2, type(num2), sep=', ')

# ---------------------------------------------------------
# int('oooo') : str -> int 타입으로 형변환 (타입 캐스팅)
# int, float, str, bool 모두 가능
# ---------------------------------------------------------
print(num1,type(int(num1)), num2, type(int(num2)), sep=', ')
# 또는 num1 = int(num1)

# ----------------------------------------------------------
# 계산하기: 사칙연산
# ----------------------------------------------------------
num1 = int(num1)
num2 = int(num2)
print(f'{num1} + {num2} = {num1+num2}') # 이렇게 +-*/ , // % , **
print(f'{num1} // {num2} = {num1//num2}')
print(f'{num1} % {num2} = {num1%num2}')
print(f'{num1} ** {num2} = {num1**num2}')